ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_LP50xx_RGB_led_string/main_LP50xx_I2C_rgb_driver.c
#include <msp430.h> 
#include <stdint.h>
#include "LP5012.h"

// SW1 = P1.1
#define SW1_PORT_DIR            P1DIR
#define SW1_PORT_OUT            P1OUT
#define SW1_PORT_REN            P1REN
#define SW1_PORT_IES            P1IES
#define SW1_PORT_IE             P1IE
#define SW1_PORT_IFG            P1IFG
#define SW1_BIT                 BIT1

// SW2 = P1.2
#define SW2_PORT_DIR            P1DIR
#define SW2_PORT_OUT            P1OUT
#define SW2_PORT_REN            P1REN
#define SW2_PORT_IES            P1IES
#define SW2_PORT_IE             P1IE
#define SW2_PORT_IFG            P1IFG
#define SW2_BIT                 BIT2


#define DISABLE     0
#define ENABLE      1

///////////////////////////////////////////////////////////////////////
// GPIO Switch interrupt part
///////////////////////////////////////////////////////////////////////

// GPIO_P1InterruptSet() : external interrupt setup for P1
// param : bits - multi-bits setup
void GPIO_SW1_SW2_Interrupt_Set(void)
{
    SW1_PORT_DIR &= ~SW1_BIT;                         // port as Input
    SW1_PORT_OUT |= SW1_BIT;                          // Configure P1 as pulled-up
    SW1_PORT_REN |= SW1_BIT;                          // P1 pull-up register enable
    SW1_PORT_IES &= ~SW1_BIT;                         // P1 edge, 0: low to high edge
    SW1_PORT_IE  |= SW1_BIT;                          // P1 interrupt enabled
    SW1_PORT_IFG &= ~SW1_BIT;                         // P1 IFG cleared

    SW2_PORT_DIR &= ~SW2_BIT;
    SW2_PORT_OUT |= SW2_BIT;                          // Configure P2.x as pulled-up
    SW2_PORT_REN |= SW2_BIT;                          // P2.x pull-up register enable
    SW2_PORT_IES &= ~SW2_BIT;                         // P2.x edge, 0: low to high edge
    SW2_PORT_IE  |= SW2_BIT;                          // P2.x interrupt enabled
    SW2_PORT_IFG &= ~SW2_BIT;                         // P2.x IFG cleared
}


void GPIO_I2C_Init(void)
{
    // LP5012
    SCL_1;
    SDA_1;
    SCL_OUT;
    SDA_OUT;
}

void GPIO_LP5012_IC_enable(unsigned char en)
{
    LP5012_EN_DIR_OUTPUT;

    if(en == 1)
        LP5012_EN_PIN_HIGH;
    else
        LP5012_EN_PIN_LOW;
    delay_ms(10);
}

void G2553_LP5012_board_init()
{
    LP5012_I2C_chip_reset(LP5012_DEV0_ADDR, 1);
    LP5012_I2C_chip_reset(LP5012_DEV1_ADDR, 1);
    LP5012_I2C_chip_reset(LP5012_DEV2_ADDR, 1);
    LP5012_I2C_chip_reset(LP5012_DEV3_ADDR, 1);
    delay_ms(100);

    LP5012_I2C_chip_enable(LP5012_DEV0_ADDR, ENABLE);
    LP5012_I2C_chip_enable(LP5012_DEV1_ADDR, ENABLE);
    LP5012_I2C_chip_enable(LP5012_DEV2_ADDR, ENABLE);
    LP5012_I2C_chip_enable(LP5012_DEV3_ADDR, ENABLE);

    LP5012_I2C_IC_init(LP5012_DEV0_ADDR, LP5012_LOG_SCALE_EN_BIT);
    LP5012_I2C_IC_init(LP5012_DEV1_ADDR, LP5012_LOG_SCALE_EN_BIT);
    LP5012_I2C_IC_init(LP5012_DEV2_ADDR, LP5012_LOG_SCALE_EN_BIT);
    LP5012_I2C_IC_init(LP5012_DEV3_ADDR, LP5012_LOG_SCALE_EN_BIT);


    delay_ms(100);

}

#define MAX_LED_PER_DEV         12      // maximum LED number for LP5012
#define MAX_RGB_LED_PER_DEV     4       // maximum RGB LED number for LP5012

#define NUM_OF_LP5012_DEV       4       // number of LP5012 in the system
#define MAX_LED                 (MAX_LED_PER_DEV*NUM_OF_LP5012_DEV)     // LED max number
#define MAX_RGB_LED_PAIR        (MAX_LED/3)                             // max RGB LED number

// for debug logging
unsigned long data_buf[0x16] = { 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0};

unsigned char dev = 0;                  // LP5012 device number
unsigned char led_bright = 0;           // LED bright
signed char led_ch = 0;               // LED order from 0 to MAX_LED
unsigned char led_per_dev_ch = 0;       // LED order from 0 to MAX_LED_PER_DEV
signed char rgb_led_ch = 0;               // RGB LED order from 0 to MAX_RGB_LED_PAIR
unsigned char rgb_led_per_dev_ch = 0;       // RGB_LED order from 0 to MAX_RGB_LED_PER_DEV
unsigned char color_index = 0;              // color index for certain color array, for _tag_color structure or array
unsigned char bank_bright = 0;              // brightness for bank
unsigned char dir_inc_dec = 0;              // indicate LED direction is inc or dec
unsigned char sequence_cnt = 0;             // sequence when color change after one cycle

#define NUM_OF_WINDOW       8
unsigned char led_bright_window[NUM_OF_WINDOW] = {0xc0, 0xa0, 0x80, 0x60, 0x40, 0x20, 0x10, 0x00};




//#define LED_TEST_MODE           1


uint8_t switch_status = 0;

// LED mode :
// sw1 action :
// - LED shift up(sw2 : All(3delay), B(3delay), G(3delay), R(3delay) ),
// - LED shift down(sw2 : All(3delay), B(3delay), G(3delay), R(3delay) ),
// - LED shift up/down(sw2 : All(3delay), B(3delay), G(3delay), R(3delay) ),
// - LED shift up with tails(sw2 : All(3delay), B(3delay), G(3delay), R(3delay) ),
// - LED shift down with tails(sw2 : All(3delay), B(3delay), G(3delay), R(3delay) ),
// - LED shift up/down with tails(sw2 : All(3delay), B(3delay), G(3delay), R(3delay) ),
#define LED_ACTION_LEDS_SHIFT_UP                1
#define LED_ACTION_LEDS_SHIFT_DOWN              2
#define LED_ACTION_LEDS_SHIFT_UPDN              3
#define LED_ACTION_LEDS_SHIFT_UP_LIKE_WAVE      4
#define LED_ACTION_LEDS_SHIFT_DOWN_LIKE_WAVE    5
#define LED_ACTION_LEDS_SHIFT_UPDN_LIKE_WAVE    6
#define LED_ACTION_LEDS_COLOR_CHANGE_STRAIGHT   7
#define LED_ACTION_LEDS_COLOR_CHANGE_SMOOTH     8
#define LED_ACTION_LEDS_COLOR_FIX_VARIOUS       9

#define LED_ACTION_LEDS_SHIFT_UP_RAINBOW        10
#define LED_ACTION_LEDS_SHIFT_DOWN_RAINBOW      11
#define LED_ACTION_LEDS_SHIFT_UPDN_RAINBOW      12

#define LED_ACTION_MAX                          13

#define LED_ACTION_RGB_EACH_LED_SHIFT_UP        255 //test

#define LED_TEST1               1
#define LED_TEST2               2
#define LED_TEST3               3
#define LED_TEST4               4
#define LED_TEST5               5
#define LED_TEST6               6
#define LED_TEST7               7
#define LED_TEST8               8
#define LED_TEST9               9

#define COLOR_WHITE         {255, 255, 255}
#define COLOR_RED           {255, 0, 0}
#define COLOR_ORANGE        {255, 127, 0}
#define COLOR_YELLOW        {255, 255, 0}
#define COLOR_CHARTREUSE    {127, 255, 0}   // in between Yellow and Green
#define COLOR_GREEN         {0, 255, 0}
#define COLOR_AQUAMARINE    {0, 255, 127}   // in between Green and Cyan
#define COLOR_CYAN          {0, 255, 255}   // Sky blue (?)
#define COLOR_AZURE         {0, 127, 255}   // in between Cyan and Blue
#define COLOR_BLUE          {0, 0, 255}
#define COLOR_VIOLET        {127, 0, 255}
#define COLOR_MAGENTA       {255, 0, 255}
#define COLOR_ROSE          {255, 0, 127}   // in between Magenta and Red

#define WHITE           {255, 255, 255}
#define SILVER          {192, 192, 192}
#define GRAY            {128, 128, 128}
#define BLACK           {0, 0, 0}
#define MAROON          {128, 0, 0}         // near dark red
#define RED             {255, 0, 0}
#define ORANGE          {255, 165, 0}
#define YELLOW          {255, 255, 0}
#define OLIVE           {128, 128, 0}       // near dark yellow
#define LIME            {0, 255, 0}         // near light green
#define GREEN           {0, 128, 0}
#define AQUA            {0, 255, 255}       // near bright blue
#define BLUE            {0, 0, 255}
#define NAVY            {0, 0, 128}         // near dark blue
#define TEAL            {0, 128, 128}       // near dark green
#define FUCHSIA         {255, 0, 255}       // near pink
#define PURPLE          {128, 0, 128}



