ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_LP50xx_RGB_led_string/main_LP50xx_I2C_rgb_driver.c
typedef struct {
    unsigned char r;
    unsigned char g;
    unsigned char b;
}_tag_color;

_tag_color color;

#define NUM_COLOR_RAINBOW   8
_tag_color colors_rainbow[8] = {
    WHITE,
    RED,
    ORANGE,
    YELLOW,
    GREEN,
    BLUE,
    NAVY,
    PURPLE
};

_tag_color colors_mix_16[16] = {
     WHITE,
     SILVER,
     GRAY,
     MAROON,
     RED,
     ORANGE,
     YELLOW,
     OLIVE,
     LIME,
     GREEN,
     AQUA,
     BLUE,
     NAVY,
     TEAL,
     FUCHSIA,
     PURPLE,
};



uint8_t led_mode = 0;               // mode : 1~8
uint8_t led_disp_color = 0;         // 0 : All, 1 : G, 2 : R, 3 : B
uint8_t brightness_level = 0;       // level : 1(dark)~3(bright)
uint8_t delay_time = 3;             // delay_time : 1(slow)~3(fast)
uint8_t update_once = 0;        // not to do excessive updates of LP5012 registers
uint8_t initial_onetime_activity = 1;
uint8_t cmd_inc_dec = 0;        // 0 : inc, 1 : dec


void main(void)
{
    WDTCTL = WDTPW | WDTHOLD;   // stop watchdog timer

    GPIO_SW1_SW2_Interrupt_Set();
    GPIO_LP5012_IC_enable(0);

    // move this for current consumption
    //GPIO_LP5012_IC_enable(1);
    //GPIO_I2C_Init();
    //G2553_LP5012_board_init();


    SW1_PORT_IFG &= ~SW1_BIT;                         // Clear PORT IFG for SW1
    SW2_PORT_IFG &= ~SW2_BIT;                         // Clear PORT IFG for SW1
    __bis_SR_register(GIE);

    while(1)
    {
        ///////////////////////////////////////////////////
        // check switch buttons are pressed : SW1
        ///////////////////////////////////////////////////
        if(switch_status & BIT0) // switch1 function : action change
        {
            if(initial_onetime_activity == 1)   // moved here for current consumption
            {
                initial_onetime_activity = 0;
                GPIO_LP5012_IC_enable(1);
                GPIO_I2C_Init();
                //G2553_LP5012_board_init();  // reset and init

            }

            G2553_LP5012_board_init();  // reset and init

            update_once = 1;
            led_mode++;
            if(led_mode >= LED_ACTION_MAX)   // end? then repeat first
            {
                led_mode = LED_ACTION_LEDS_SHIFT_UP;
            }

            switch_status &= ~BIT0;
        }

        /////////////////////////////////////////////////
        // check switch buttons are pressed : SW2
        /////////////////////////////////////////////////
        if(switch_status & BIT1)    // switch2 function : brightness or delay time change
        {
            update_once = 1;

            delay_time--;
            if(delay_time == 0)
            {
                delay_time = 3;
                led_disp_color++;
                if(led_disp_color > 3)  // 0:All, 1:G, 2:R, 3:B
                {
                    led_disp_color = 0;
                }
            }

            switch_status &= ~BIT1;
        }

        /////////////////////////////////////////////////
        // actions for case by case of the buttons
        /////////////////////////////////////////////////
        switch (led_mode)
        {
            case LED_ACTION_RGB_EACH_LED_SHIFT_UP : //test for each LED is on or not
            {
                if(update_once == 1)   // update one time when the button pressed
                {
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV1_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV2_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV3_ADDR, 0x40, 0x40, 0x40, 0x40);

                    // seperate color control
                    for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                    {
                        for(led_per_dev_ch=0; led_per_dev_ch<MAX_LED_PER_DEV; led_per_dev_ch++)
                        {
                            LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, led_per_dev_ch, 0x00);
                        }
                    }
                    led_ch = 0;
                }

                // off the previous LED
                if(led_ch == 0)
                    LP5012_I2C_OUTx_color((LP5012_DEV0_ADDR+NUM_OF_LP5012_DEV-1), MAX_LED_PER_DEV-1, 0);
                else
                    LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, led_per_dev_ch, 0);

                dev = (unsigned char) led_ch / MAX_LED_PER_DEV;
                led_per_dev_ch = (unsigned char) led_ch % MAX_LED_PER_DEV;

                LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, led_per_dev_ch, 0x30);
                led_ch++;
                if(led_ch == MAX_LED)
                    led_ch = 0;


                if(delay_time == 1)
                    delay_ms(50);
                else if(delay_time == 2)
                    delay_ms(150);
                else if(delay_time == 3)
                    delay_ms(250);
                else
                    delay_ms(250);

                __no_operation();


            }break;

            case LED_ACTION_LEDS_SHIFT_UP :
            {
                if(update_once == 1)   // update one time when the button pressed
                {
                    // separate color control
                    for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                    {
                        LP5012_I2C_bank_control_mode(LP5012_DEV0_ADDR+dev, 0);
                        LP5012_I2C_bank_brightness(LP5012_DEV0_ADDR+dev, 0x80);
                        LP5012_I2C_bank_color(LP5012_DEV0_ADDR+dev, 0x80, 0x80, 0x80);
                    }

                    dev = 0;
                    rgb_led_per_dev_ch = 0;
                    rgb_led_ch = 0;
                }

                // off the previous LED
                if(rgb_led_per_dev_ch == MAX_RGB_LED_PER_DEV-1)
                {
                    LP5012_I2C_bank_control_mode((LP5012_DEV0_ADDR+dev), 0);
                }

                dev = (unsigned char) rgb_led_ch / MAX_RGB_LED_PER_DEV;
                rgb_led_per_dev_ch = (unsigned char) rgb_led_ch % MAX_RGB_LED_PER_DEV;

                LP5012_I2C_bank_control_mode_single(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch);

