ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_LP50xx_RGB_led_string/main_LP50xx_I2C_rgb_driver.c
                rgb_led_ch++;       // increasing
                if(rgb_led_ch == MAX_RGB_LED_PAIR)
                    rgb_led_ch = 0;

                if(delay_time == 1)
                    delay_ms(50);
                else if(delay_time == 2)
                    delay_ms(150);
                else if(delay_time == 3)
                    delay_ms(250);
                else
                    delay_ms(250);

                __no_operation();

            }break;

//#define LED_ACTION_LEDS_SHIFT_UP_RAINBOW        10
//#define LED_ACTION_LEDS_SHIFT_DOWN_RAINBOW      11
//#define LED_ACTION_LEDS_SHIFT_UPDN_RAINBOW      12
#if 1
            case LED_ACTION_LEDS_SHIFT_UP_RAINBOW :
            {
                if(update_once == 1)   // update one time when the button pressed
                {
                    // separate color control
                    for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                    {
                        LP5012_I2C_bank_control_mode(LP5012_DEV0_ADDR+dev, 0);
                        LP5012_I2C_bank_brightness(LP5012_DEV0_ADDR+dev, 0);
                        LP5012_I2C_bank_color(LP5012_DEV0_ADDR+dev, 0, 0, 0);
                        LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR+dev, 0x00, 0x00, 0x00, 0x00);
                    }

                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV1_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV2_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV3_ADDR, 0x40, 0x40, 0x40, 0x40);

                    dev = 0;
                    rgb_led_per_dev_ch = 0;
                    rgb_led_ch = 0;
                    sequence_cnt = 0;
                }

                //if(led_ch == 0)
                //    LP5012_I2C_OUTx_color((LP5012_DEV0_ADDR+NUM_OF_LP5012_DEV-1), MAX_RGB_LED_PER_DEV-1, 0);
                //else
                //    LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, led_per_dev_ch, 0);

                // off the previous LED
                if(led_ch == 0)
                {
                //    LP5012_I2C_OUTx_color((LP5012_DEV0_ADDR+NUM_OF_LP5012_DEV-1), rgb_led_per_dev_ch*3+0, 0x00);
                //    LP5012_I2C_OUTx_color((LP5012_DEV0_ADDR+NUM_OF_LP5012_DEV-1), rgb_led_per_dev_ch*3+1, 0x00);
                //    LP5012_I2C_OUTx_color((LP5012_DEV0_ADDR+NUM_OF_LP5012_DEV-1), rgb_led_per_dev_ch*3+2, 0x00);
                }
                else
                {
                //    LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch*3+0, 0x00);
                //    LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch*3+1, 0x00);
                //    LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch*3+2, 0x00);
                }

                dev = (unsigned char) rgb_led_ch / MAX_RGB_LED_PER_DEV;
                rgb_led_per_dev_ch = (unsigned char) rgb_led_ch % MAX_RGB_LED_PER_DEV;

                LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch*3+0, colors_rainbow[sequence_cnt].b);
                LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch*3+1, colors_rainbow[sequence_cnt].r);
                LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch*3+2, colors_rainbow[sequence_cnt].g);

                rgb_led_ch++;       // increasing
                if(rgb_led_ch == MAX_RGB_LED_PAIR)
                {
                    rgb_led_ch = 0;
                    sequence_cnt++;
                    if(sequence_cnt == NUM_COLOR_RAINBOW)
                    {
                        sequence_cnt = 0;
                    }
                }

                if(delay_time == 1)
                    delay_ms(50);
                else if(delay_time == 2)
                    delay_ms(150);
                else if(delay_time == 3)
                    delay_ms(250);
                else
                    delay_ms(250);

                __no_operation();

            }break;
#endif
            case LED_ACTION_LEDS_SHIFT_DOWN :
            {
                if(update_once == 1)   // update one time when the button pressed
                {
                    // separate color control
                    for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                    {
                        LP5012_I2C_bank_control_mode(LP5012_DEV0_ADDR+dev, 0);
                        LP5012_I2C_bank_brightness(LP5012_DEV0_ADDR+dev, 0x80);
                        LP5012_I2C_bank_color(LP5012_DEV0_ADDR+dev, 0x80, 0x80, 0x80);
                    }

                    dev = 0;
                    rgb_led_per_dev_ch = 0;
                    rgb_led_ch = MAX_RGB_LED_PAIR-1;
                }

                // off the previous LED
                if(rgb_led_per_dev_ch == 0)
                {
                    LP5012_I2C_bank_control_mode((LP5012_DEV0_ADDR+dev), 0);
                }

                dev = (unsigned char) rgb_led_ch / MAX_RGB_LED_PER_DEV;
                rgb_led_per_dev_ch = (unsigned char) rgb_led_ch % MAX_RGB_LED_PER_DEV;

                LP5012_I2C_bank_control_mode_single(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch);

                rgb_led_ch--;       // decreasing
                if(rgb_led_ch == -1)
                    rgb_led_ch = MAX_RGB_LED_PAIR-1;

                if(delay_time == 1)
                    delay_ms(50);
                else if(delay_time == 2)
                    delay_ms(150);
                else if(delay_time == 3)
                    delay_ms(250);
                else
                    delay_ms(250);

                __no_operation();

            }break;
            case LED_ACTION_LEDS_SHIFT_UPDN :
            {
                if(update_once == 1)   // update one time when the button pressed
                {
                    // separate color control
                    for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                    {
                        LP5012_I2C_bank_control_mode(LP5012_DEV0_ADDR+dev, 0);
                        LP5012_I2C_bank_brightness(LP5012_DEV0_ADDR+dev, 0x80);
                        LP5012_I2C_bank_color(LP5012_DEV0_ADDR+dev, 0x80, 0x80, 0x80);
                    }

                    dev = 0;
                    rgb_led_per_dev_ch = 0;
                    rgb_led_ch = 0;
                    dir_inc_dec = 0;    // increasing
                }

