ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_LP50xx_RGB_led_string/main_LP50xx_I2C_rgb_driver.c
                if(dir_inc_dec == 0)
                {
                    // off the previous LED
                    if(rgb_led_per_dev_ch == MAX_RGB_LED_PER_DEV-1)
                    {
                        LP5012_I2C_bank_control_mode((LP5012_DEV0_ADDR+dev), 0);
                    }

                    dev = (unsigned char) rgb_led_ch / MAX_RGB_LED_PER_DEV;
                    rgb_led_per_dev_ch = (unsigned char) rgb_led_ch % MAX_RGB_LED_PER_DEV;

                    LP5012_I2C_bank_control_mode_single(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch);

                    rgb_led_ch++;       // increasing
                    if(rgb_led_ch == MAX_RGB_LED_PAIR)
                    {
                        rgb_led_ch = MAX_RGB_LED_PAIR-1;;
                        dir_inc_dec = 1;
                    }
                }

                else
                {
                    // off the previous LED
                    if(rgb_led_per_dev_ch == 0)
                    {
                        LP5012_I2C_bank_control_mode((LP5012_DEV0_ADDR+dev), 0);
                    }

                    dev = (unsigned char) rgb_led_ch / MAX_RGB_LED_PER_DEV;
                    rgb_led_per_dev_ch = (unsigned char) rgb_led_ch % MAX_RGB_LED_PER_DEV;

                    LP5012_I2C_bank_control_mode_single(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch);

                    rgb_led_ch--;       // decreasing
                    if(rgb_led_ch == -1)
                    {
                        rgb_led_ch = 0;
                        dir_inc_dec = 0;
                    }
                }


                if(delay_time == 1)
                    delay_ms(50);
                else if(delay_time == 2)
                    delay_ms(150);
                else if(delay_time == 3)
                    delay_ms(250);
                else
                    delay_ms(250);

                __no_operation();

            }break;
//////////////////////////////
            case LED_ACTION_LEDS_SHIFT_UP_LIKE_WAVE :
            {
                signed char new_position = 0;

                if(update_once == 1)   // update one time when the button pressed
                {
                    // clean registers
                    for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                    {
                        LP5012_I2C_bank_control_mode(LP5012_DEV0_ADDR+dev, 0);
                        LP5012_I2C_bank_brightness(LP5012_DEV0_ADDR+dev, 0);
                        LP5012_I2C_bank_color(LP5012_DEV0_ADDR+dev, 0, 0, 0);
                        LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR+dev, 0x00, 0x00, 0x00, 0x00);
                    }

                    // initial registers
                    for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                    {
                        for(led_ch=0; led_ch<MAX_LED_PER_DEV; led_ch++)
                        {
                            LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, led_ch, 0x80);
                        }
                    }

                    dev = 0;
                    rgb_led_per_dev_ch = 0;
                    rgb_led_ch = 0;
                }

                // for some blinking effect
                //for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                //    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR+dev, 0x00, 0x00, 0x00, 0x00);

                new_position = rgb_led_ch;
                for(color_index=0; color_index<NUM_OF_WINDOW; color_index++)
                {
                    if( new_position < 0 )
                    {
                        break;      // exit if start points are less than the window size (edge case)
                    }

                    if( new_position > MAX_RGB_LED_PAIR)
                    {
                        //continue;   // skip if window size exceed the end points
                    }
                    else            // normal case
                    {
                        dev = (unsigned char) new_position / MAX_RGB_LED_PER_DEV;
                        rgb_led_per_dev_ch = (unsigned char) new_position % MAX_RGB_LED_PER_DEV;
                        LP5012_I2C_LEDx_brightness(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch, led_bright_window[color_index]);
                    }

                    new_position--;
                }

                rgb_led_ch++;       // brightest LED location
                if(rgb_led_ch == (MAX_RGB_LED_PAIR + NUM_OF_WINDOW) )   // do more for the tail of the window
                    rgb_led_ch = 0;

                if(delay_time == 1)
                    delay_ms(50);
                else if(delay_time == 2)
                    delay_ms(150);
                else if(delay_time == 3)
                    delay_ms(250);
                else
                    delay_ms(250);

                __no_operation();
            }break;
#if 1
            case LED_ACTION_LEDS_SHIFT_DOWN_LIKE_WAVE :
            {
                signed char new_position = 0;

                if(update_once == 1)   // update one time when the button pressed
                {
                    // clean registers
                    for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                    {
                        LP5012_I2C_bank_control_mode(LP5012_DEV0_ADDR+dev, 0);
                        LP5012_I2C_bank_brightness(LP5012_DEV0_ADDR+dev, 0);
                        LP5012_I2C_bank_color(LP5012_DEV0_ADDR+dev, 0, 0, 0);
                        LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR+dev, 0x00, 0x00, 0x00, 0x00);
                    }

                    // initial registers
                    for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                    {
                        for(led_ch=0; led_ch<MAX_LED_PER_DEV; led_ch++)
                        {
                            LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, led_ch, 0x80);
                        }
                    }

                    dev = NUM_OF_LP5012_DEV-1;
                    rgb_led_per_dev_ch = MAX_RGB_LED_PER_DEV;
                    rgb_led_ch = MAX_RGB_LED_PAIR-1;
                }

                // for some blinking effect
                //for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                //    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR+dev, 0x00, 0x00, 0x00, 0x00);

                new_position = rgb_led_ch;
                for(color_index=0; color_index<NUM_OF_WINDOW; color_index++)
                {
                    if( new_position >= MAX_RGB_LED_PAIR )
                    {
                        break;      // exit if start points are more than the window size (edge case)
                    }

                    if( new_position < 0)
                    {
                        //continue;   // skip if window size exceed the end points
                    }
                    else            // normal case
                    {
                        dev = (unsigned char) new_position / MAX_RGB_LED_PER_DEV;
                        rgb_led_per_dev_ch = (unsigned char) new_position % MAX_RGB_LED_PER_DEV;
                        LP5012_I2C_LEDx_brightness(LP5012_DEV0_ADDR+dev, rgb_led_per_dev_ch, led_bright_window[color_index]);
                    }

