ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_LP50xx_RGB_led_string/main_LP50xx_I2C_rgb_driver.c
                    new_position++;
                }

                rgb_led_ch--;       // brightest LED location
                if(rgb_led_ch == (0 - NUM_OF_WINDOW) )   // do more for the tail of the window
                    rgb_led_ch = MAX_RGB_LED_PAIR -1;

                if(delay_time == 1)
                    delay_ms(50);
                else if(delay_time == 2)
                    delay_ms(150);
                else if(delay_time == 3)
                    delay_ms(250);
                else
                    delay_ms(250);

                __no_operation();
            }break;
#endif
            case LED_ACTION_LEDS_COLOR_CHANGE_STRAIGHT :
            {
                __no_operation();
            }break;
            case LED_ACTION_LEDS_COLOR_CHANGE_SMOOTH :
            {
                __no_operation();
            }break;
            case LED_ACTION_LEDS_COLOR_FIX_VARIOUS :
            {
                if(update_once == 1)   // update one time when the button pressed
                {
                    // clean registers
                    for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                    {
                        LP5012_I2C_bank_control_mode(LP5012_DEV0_ADDR+dev, 0);
                        LP5012_I2C_bank_brightness(LP5012_DEV0_ADDR+dev, 0);
                        LP5012_I2C_bank_color(LP5012_DEV0_ADDR+dev, 0, 0, 0);
                        LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR+dev, 0x00, 0x00, 0x00, 0x00);
                    }
#if 1

                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV1_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV2_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV3_ADDR, 0x40, 0x40, 0x40, 0x40);

                    {
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 0, colors_mix_16[0].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 1, colors_mix_16[0].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 2, colors_mix_16[0].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 3, colors_mix_16[1].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 4, colors_mix_16[1].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 5, colors_mix_16[1].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 6, colors_mix_16[2].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 7, colors_mix_16[2].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 8, colors_mix_16[2].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 9, colors_mix_16[3].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 10, colors_mix_16[3].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR, 11, colors_mix_16[3].g);


                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 0, colors_mix_16[4].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 1, colors_mix_16[4].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 2, colors_mix_16[4].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 3, colors_mix_16[5].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 4, colors_mix_16[5].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 5, colors_mix_16[5].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 6, colors_mix_16[6].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 7, colors_mix_16[6].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 8, colors_mix_16[6].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 9, colors_mix_16[7].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 10, colors_mix_16[7].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+1, 11, colors_mix_16[7].g);



                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 0, colors_mix_16[8].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 1, colors_mix_16[8].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 2, colors_mix_16[8].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 3, colors_mix_16[9].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 4, colors_mix_16[9].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 5, colors_mix_16[9].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 6, colors_mix_16[10].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 7, colors_mix_16[10].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 8, colors_mix_16[10].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 9, colors_mix_16[11].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 10, colors_mix_16[11].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+2, 11, colors_mix_16[11].g);



                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 0, colors_mix_16[12].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 1, colors_mix_16[12].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 2, colors_mix_16[12].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 3, colors_mix_16[13].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 4, colors_mix_16[13].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 5, colors_mix_16[13].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 6, colors_mix_16[14].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 7, colors_mix_16[14].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 8, colors_mix_16[14].g);

                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 9, colors_mix_16[15].b);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 10, colors_mix_16[15].r);
                        LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+3, 11, colors_mix_16[15].g);



