ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_LP50xx_RGB_led_string/main_LP50xx_I2C_rgb_driver.c
                    }
#else
                    // initial registers
                    for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                    {
                        for(led_ch=0; led_ch<MAX_LED_PER_DEV; led_ch++)
                        {
                            LP5012_I2C_OUTx_color(LP5012_DEV0_ADDR+dev, led_ch, colors_mix_16[dev*4+led_ch/3].);
                        }
                    }
#endif

                    dev = 0;
                    rgb_led_per_dev_ch = 0;
                    rgb_led_ch = 0;
                }

                // for some blinking effect
                //for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
                //    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR+dev, 0x00, 0x00, 0x00, 0x00);


                if(delay_time == 1)
                {
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR, 0xa0, 0xa0, 0xa0, 0xa0);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV1_ADDR, 0xa0, 0xa0, 0xa0, 0xa0);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV2_ADDR, 0xa0, 0xa0, 0xa0, 0xa0);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV3_ADDR, 0xa0, 0xa0, 0xa0, 0xa0);
                }
                else if(delay_time == 2)
                {
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR, 0x80, 0x80, 0x80, 0x80);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV1_ADDR, 0x80, 0x80, 0x80, 0x80);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV2_ADDR, 0x80, 0x80, 0x80, 0x80);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV3_ADDR, 0x80, 0x80, 0x80, 0x80);
                }
                else if(delay_time == 3)
                {
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV1_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV2_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV3_ADDR, 0x40, 0x40, 0x40, 0x40);
                }
                else
                {
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV1_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV2_ADDR, 0x40, 0x40, 0x40, 0x40);
                    LP5012_I2C_LEDx_ch_brightness(LP5012_DEV3_ADDR, 0x40, 0x40, 0x40, 0x40);
                }

                __no_operation();
            }break;
            default : break;
        }
        update_once = 0;

#if 0
        /////////////////////////////////////////////////
        // actions for case by case of the buttons
        /////////////////////////////////////////////////

        LP5012_I2C_bank_control_mode(LP5012_DEV0_ADDR, 1);
        LP5012_I2C_bank_control_mode(LP5012_DEV1_ADDR, 1);
        LP5012_I2C_bank_control_mode(LP5012_DEV2_ADDR, 1);
        LP5012_I2C_bank_control_mode(LP5012_DEV3_ADDR, 1);

        LP5012_I2C_bank_brightness(LP5012_DEV0_ADDR, 0x7F);
        LP5012_I2C_bank_brightness(LP5012_DEV1_ADDR, 0x7F);
        LP5012_I2C_bank_brightness(LP5012_DEV2_ADDR, 0x7F);
        LP5012_I2C_bank_brightness(LP5012_DEV3_ADDR, 0x7F);

        for(dev=0; dev<NUM_OF_LP5012_DEV; dev++)
        {
            for(led_bright = 0; led_bright < 0xd0; led_bright += 0x20)
            {
                LP5012_I2C_bank_color(LP5012_DEV0_ADDR+dev, led_bright, 0, 0);
                delay_ms(200);
            }
            for(led_bright = 0; led_bright < 0xd0; led_bright += 0x20)
            {
                LP5012_I2C_bank_color(LP5012_DEV0_ADDR+dev, 0, led_bright, 0);
                delay_ms(200);
            }
            for(led_bright = 0; led_bright < 0xd0; led_bright += 0x20)
            {
                LP5012_I2C_bank_color(LP5012_DEV0_ADDR+dev, 0, 0, led_bright);
                delay_ms(200);
            }
        }


        update_once = 0;
        //for(i=0; i<0x16; i++)
        //{
        //    i2c_read_byte(LP5012_DEV0_ADDR, i, &data);
        //    data_buf[i] = data;
        //}
#endif
    }
}


// Port 1 interrupt service routine
#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void)
{
    // switch 1 detection ==> sw1 function : mode change
    if(SW1_PORT_IFG & SW1_BIT)
    {
        SW1_PORT_IFG &= ~SW1_BIT;                         // Clear PORT IFG for SW1

        if(switch_status == BIT1)   // do not operate if another switch pin is on operation
        {
            ;
        }
        else
        {
            switch_status |= BIT0;
        }
    }

    else
    {
        SW1_PORT_IFG &= ~SW1_BIT;
    }

    // switch 2 detection ==> sw2 function : brightness control
    if(SW2_PORT_IFG & SW2_BIT)
    {
        SW2_PORT_IFG &= ~SW2_BIT;                         // Clear PORT IFG for SW1

        if(switch_status == BIT0)   // do not operate if another switch pin is on operation
        {
            ;
        }
        else
        {
            switch_status |= BIT1;
        }
    }

    else
    {
        SW2_PORT_IFG &= ~SW2_BIT;
    }

}




